# 三个数据字典
radius_pdr_data = {
    'Random': [70.76, 59.89, 52.72, 48.59, 39.84],
    'Round-Robin': [75.11, 62.51, 55.19, 51.21, 40.83],
    'ADR': [80.41, 75.64, 70.22, 67.31, 59.25],
    'RSLoRa': [66.62, 56.19, 49.33, 45.42, 39.84],
    'DALoRa': [90.91, 89.83, 88.30, 85.81, 80.14]
}

radius_NetEE_data = {
    'Random': [5.790, 4.901, 4.314, 3.976, 3.260],
    'Round-Robin': [6.633, 5.520, 4.874, 4.522, 3.606],
    'ADR': [5.977, 4.389, 3.375, 2.953, 2.047],
    'RSLoRa': [13.808, 8.624, 6.239, 5.276, 2.960],
    'DALoRa': [10.527, 4.950, 2.791, 2.631, 1.620]
}

radius_Throughput_data = {
    'Random': [431.609, 365.315, 321.570, 296.404, 243.020],
    'Round-Robin': [498.439, 414.796, 366.239, 339.808, 270.949],
    'ADR': [869.959, 718.901, 590.566, 527.757, 379.855],
    'RSLoRa': [418.612, 353.071, 309.995, 285.417, 250.312],
    'DALoRa': [573.615, 551.314, 490.888, 461.912, 304.005]
}

# 新的字典，存储对应位置的值相加结果
new_dict = {}

# 遍历每个字典中的键和值
for key in radius_pdr_data.keys():
    new_dict[key] = [sum(values) for values in zip(radius_pdr_data[key], radius_NetEE_data[key], radius_Throughput_data[key])]

print(new_dict)
